export const data = [
  {
    name: '7.25 新月岛猜测掉落',
    children: [
      {
        name: '坐骑',
        items: [
          24219, // 火巨人角笛
          24630, // 优雷卡盐蓝燕角笛
          30102, // 劳动十四号认证密钥
          30861, // 加百列α认证密钥
          32846, // 加百列III号机认证密钥
          33684, // 恐爪龙角笛
        ],
      },
      {
        /*
        {
          "类型ID": 81,
          "独占": false,
          "$and": [{
            "宠物.版本": {
              "$gte": 4.0
            }
          },{
            "宠物.版本": {
              "$lt": 5.0
            }
          }]
        }
        */
        name: '宠物 - 4.X',
        items: [
          20524, // 巧儿海陆行鸟
          20525, // 獭獭
          20528, // 龙之孙
          20529, // 刺球球
          20530, // 分福
          20531, // 旅雀儿
          20533, // 新型迷你夕雾
          20536, // 迷你格林瓦特
          20538, // 伊沃恩玩偶
          20539, // 迷你奇美拉
          20541, // 魔导复仇者追踪型
          20542, // 吉多
          20544, // 迷你库洛
          20545, // 须佐之男之形
          20546, // 吉祥天女之形
          20547, // 俾斯麦之形
          20537, // 迷你鲶鱼精
          21055, // 迷你飞燕
          21057, // 罗波那之形
          21058, // 豆豆柴
          23998, // 泥小点
          24002, // 水豚幼崽
          24001, // 小长颈驼
          24000, // 艾尔凡人偶
          24634, // 青帝
          24639, // 迷你武装重甲
          24903, // 小刺猬
          24902, // 南方度假獭獭
          24635, // 有限的美德
          24640, // 小雪童子
          21063, // 六角小螈螈
          21060, // 象魔人偶
          21059, // 天狗玩偶
          21064, // 小树袋熊
          21065, // 神龙玩偶
          21193, // 椒盐海豹
          21911, // 白鼬
          21916, // 迷你莫艾石像
          21920, // 白小虎
          21921, // 舞海月
          21922, // 金鲶
          21917, // 米斯拉人偶
          21918, // 迷你法夫纳
          21919, // 常风王子
          21915, // 迷你玛格奈
          23030, // 迷你纱都
          23032, // 齐天小圣
          23036, // 迷你熙洛
          23027, // 凯西幼苗
          23028, // 塔鲁塔鲁人偶
          23989, // 朱孔雀
        ],
      },
      {
        name: '宠物 - 5.X',
        items: [
          26787, // 黑豆柴
          26788, // 变色龙
          26790, // 小犰狳
          26793, // 小小冰海天使
          26798, // 迷你欧米茄M
          26799, // 迷你欧米茄F
          26801, // 石莲小猬
          26803, // 鲸头鹳
          26806, // 得到宽恕的仇恨
          26789, // 水妖人偶
          26802, // 鮣鱼级潜水艇
          28618, // 猪小仙
          28620, // 神秘兵装
          28624, // 多玛金鱼儿
          28621, // 狐獴
          28626, // 小凉南希
          28627, // 大哥布林人偶
          28622, // 白小骑士
          30088, // 黄金塔罗斯
          30093, // 银山雀儿
          30096, // 小小古代人
          28628, // 小刻耳柏洛斯
          30094, // 烹调猴面雀儿
          30095, // 衣匠猴面雀儿
          30872, // 幻影亡灵法师
          30873, // 亚拉戈西瓜
          30874, // 沙狐
          30871, // 肥肥风筝猫
          30875, // 无齿翼龙幼崽
          30870, // 魔导地狱潜者追踪型
          30876, // 达因斯莱瓦追踪型
          32856, // 水小滴
          32848, // 希尔德拉级潜水艇P型
          32858, // 黄金大河狸
          32857, // 三角龙龙
          32855, // 天佑公主
          33693, // 魔导猎手追踪型
          33691, // 小小食蚁兽
          33696, // 浪人的篝火
          33695, // 本本石
        ],
      },
      {
        name: '宠物 - 6.X',
        items: [
          35970, // 小旗
          35972, // 梅加斯三姐妹之形
          35973, // 集成奥密克戎
          35974, // 阿尼玛之形
          35977, // 新型迷你于里昂热
          35979, // 河马幼崽
          35980, // 蟹蟹
          35981, // 月面仙人刺王子
          35984, // 冒险者野餐篮
          35986, // 小草贤人
          35987, // 格雷布洛弗玩偶
          36637, // 王家仙人刺
          36852, // 袋鼠玩偶
          36855, // 吉娃汪
          36854, // 门小奴
          36856, // 发条小汽车
          36860, // 蓝足鲣鸟
          38450, // 鼯鼠
          38448, // 斯卡米留尼之形
          38451, // 擦擦羽衣精
          38452, // 水道蜥蜴
          38453, // 迷你好友
          39474, // 柯基犬
          39476, // 铃小龙
          39478, // 凯纳槽之形
          39482, // 小火车
          39484, // 迷你艾多纽斯
          39480, // 私用棒槌树
          40369, // 海鹦
          40374, // 黑小猩
          40375, // 惊奇炸药仔
          40380, // 迷你巴尔巴莉希娅
          40376, // 小吕萨
          40381, // 遮光器土偶
          40371, // 送行提灯
          40377, // 忍犬白丸
          40378, // 忍犬黑丸
          41475, // 西德尼亚丘灵
          41477, // 迷你高贝扎
          41471, // 乌洛萨帕
          41486, // 雷普鲁
        ],
      },
      {
        name: '时装',
        items: [
          21937, // 冒险者毛衣
          21936, // 冬意毛衣
          23373, // 风尚礼帽
          23001, // 风尚褶边连衣裙
          23002, // 风尚花边短裙
          23374, // 风尚礼鞋
          21202, // 萨维奈秋意衬衫
          21203, // 萨维奈秋意礼服
          21204, // 拉札罕秋意衬衫
          22997, // 花花公子帽
          22998, // 花花公子皱边礼服衬衫
          22999, // 花花公子皱边裤
          23000, // 花花公子便鞋
          21941, // 阿拉米格长外衣
          23350, // 恒冰头巾
          23351, // 恒冰衬衫
          23352, // 恒冰缠手带
          23353, // 恒冰束膝裤
          23354, // 恒冰凉鞋
          23355, // 恒冰头饰
          23356, // 恒冰短外套
          23357, // 恒冰手套
          23358, // 恒冰及膝裤
          23359, // 恒冰工作靴
          24591, // 雨兜
          24592, // 雨衣
          24593, // 雨靴
          24004, // 私语呢绒大衣
          24005, // 私语呢绒打底裤
          24006, // 私语呢绒短靴
          27941, // 夏季靛蓝衬衫
          27942, // 夏季靛蓝七分裤
          27938, // 玻璃革兜帽坎肩
          27991, // 冒险者兜帽坎肩
          27939, // 玻璃革七分裤
          27940, // 牛皮鞋
          28588, // 都市外套
          28589, // 都市筒靴
          28590, // 叛逆外套
          28591, // 叛逆筒靴
          30755, // 南洋海滨衬衫
          30756, // 南洋海滨软甲裤
          30757, // 南洋海滨短裙
          30758, // 南洋海滨皮鞋
          30055, // 达尔马斯卡垂褶上装
          30056, // 达尔马斯卡垂褶下装
          30057, // 达尔马斯卡皮鞋
          24339, // 古恶魔长角
        ],
      },
      {
        name: '发型 & 时尚配饰',
        items: [
          24233, // 发型样式：发箍式编发
          32835, // 发型样式：黎明辫
          33706, // 发型样式：侧马尾辫
          31407, // 发型样式：飞翔者
          44263, // 面部配饰：基础款眼镜
          45006, // 面部配饰：窄框眼镜
          45005, // 面部配饰：猫眼眼镜
          44264, // 面部配饰：单眼镜
        ],
      },
      {
        name: '情感动作',
        items: [
          23366, // 演技教材·好冷
          24224, // 演技教材·说明计划
          31403, // 演技教材·诅咒
          31402, // 演技教材·巡视
          32828, // 演技教材·搓手
        ],
      },
      {
        name: '家具',
        items: [
          23875, // 天然水晶
          28980, // 天然黄水晶
          27287, // 天然赤水晶
          24505, // 天然青水晶
          24490, // 天然绿水晶
          27286, // 水晶都茶壶
          27282, // 水晶都长椅
          27291, // 水晶都机械式收银台
          27284, // 水晶都厨房壁炉
          27285, // 水晶都厨房壁挂架
          44120, // 垂直霓虹墙灯
          44119, // 水平霓虹墙灯
          44111, // 岩石隔离墙
        ],
      },
    ],
  },
  {
    name: '染剂',
    children: [
      {
        name: '黑白灰',
        items: [
          5729, // 素雪白染剂
          5730, // 苍白灰染剂
          5731, // 古菩灰染剂
          5732, // 石板灰染剂
          5733, // 木炭灰染剂
          5734, // 煤烟黑染剂
        ],
      },
      {
        name: '红',
        items: [
          5735, // 玫瑰粉染剂
          5736, // 丁香紫染剂
          5737, // 罗兰莓染剂
          5738, // 卫月红染剂
          5739, // 铁锈红染剂
          5740, // 果酒红染剂
          5741, // 珊瑚粉染剂
          5742, // 鲜血红染剂
          5743, // 鲑鱼粉染剂
          30116, // 宝石红染剂
          30117, // 樱桃粉染剂
        ],
      },
      {
        name: '棕',
        items: [
          5744, // 日落橙染剂
          5745, // 台地红染剂
          5746, // 树皮棕染剂
          5747, // 巧克力染剂
          5748, // 铁锈棕染剂
          5749, // 钴铁棕染剂
          5750, // 软木棕染剂
          5751, // 卢恩棕染剂
          5752, // 奥猴棕染剂
          5753, // 山羊棕染剂
          5754, // 南瓜橙染剂
          5755, // 橡果棕染剂
          5756, // 果园棕染剂
          5757, // 山栗棕染剂
          5758, // 哥布林染剂
          5759, // 页岩棕染剂
          5760, // 鼹鼠棕染剂
          5761, // 沃土棕染剂
        ],
      },
      {
        name: '黄',
        items: [
          5762, // 骸骨白染剂
          5763, // 黄沙棕染剂
          5764, // 沙漠黄染剂
          5765, // 蜂蜜黄染剂
          5766, // 玉米黄染剂
          5767, // 猛豹黄染剂
          5768, // 奶油黄染剂
          5769, // 日影黄染剂
          5770, // 萄干棕染剂
          30118, // 丝雀黄染剂
          30119, // 香草黄染剂
        ],
      },
      {
        name: '绿',
        items: [
          5771, // 泥沼绿染剂
          5772, // 妖精绿染剂
          5773, // 青柠绿染剂
          5774, // 苔藓绿染剂
          5775, // 牧草绿染剂
          5776, // 橄榄绿染剂
          5777, // 沼泽绿染剂
          5778, // 苹果绿染剂
          5779, // 仙人掌染剂
          5780, // 猎人绿染剂
          5781, // 口花绿染剂
          5782, // 金龟绿染剂
          5783, // 地神绿染剂
          5784, // 深林绿染剂
          5785, // 天上蓝染剂
          5786, // 绿松蓝染剂
          5787, // 魔花绿染剂
        ],
      },
      {
        name: '蓝',
        items: [
          5788, // 寒冰蓝染剂
          5789, // 天空蓝染剂
          5790, // 海雾蓝染剂
          5791, // 孔雀蓝染剂
          5792, // 罗海蓝染剂
          5793, // 腐尸蓝染剂
          5794, // 青磷蓝染剂
          5795, // 靛青蓝染剂
          5796, // 油墨蓝染剂
          5797, // 盗龙蓝染剂
          5798, // 东洲蓝染剂
          5799, // 风暴蓝染剂
          5800, // 虚空蓝染剂
          5801, // 皇室蓝染剂
          5802, // 午夜蓝染剂
          5803, // 阴影蓝染剂
          5804, // 深渊蓝染剂
          30120, // 龙骑蓝染剂
          30121, // 松石蓝染剂
        ],
      },
      {
        name: '紫',
        items: [
          5805, // 薰衣草染剂
          5806, // 忧郁紫染剂
          5807, // 醋栗紫染剂
          5808, // 鸢尾紫染剂
          5809, // 葡萄紫染剂
          5810, // 莲花粉染剂
          5811, // 蜂鸟粉染剂
          5812, // 仙子梅染剂
          5813, // 帝王紫染剂
        ],
      },
      {
        name: '稀有',
        items: [
          13114, // 无瑕白染剂
          13115, // 煤玉黑染剂
          13708, // 柔彩粉染剂
          13709, // 黑暗红染剂
          13710, // 黑暗棕染剂
          13711, // 柔彩绿染剂
          13712, // 黑暗绿染剂
          13713, // 柔彩蓝染剂
          13714, // 黑暗蓝染剂
          13715, // 柔彩紫染剂
          13716, // 黑暗紫染剂
          13116, // 闪耀银染剂
          13117, // 闪耀金染剂
          13717, // 金属红染剂
          13718, // 金属橙染剂
          13719, // 金属黄染剂
          13720, // 金属绿染剂
          13721, // 金属蓝染剂
          13722, // 金属靛染剂
          13723, // 金属紫染剂
          30122, // 炮铜黑染剂
          30123, // 珍珠白染剂
          30124, // 金属铜染剂
        ],
      },
    ],
  },
  {
    name: '魔晶石',
    children: [
      {
        name: '战斗 - 雄略',
        items: [
          5674,
          5675,
          5676,
          5677,
          5678,
          18020,
          25189,
          26730,
          33920,
          33933,
          41760,
          41773,
        ],
      },
      {
        name: '战斗 - 神眼',
        items: [
          5664,
          5665,
          5666,
          5667,
          5668,
          18018,
          25187,
          26728,
          33918,
          33931,
          41758,
          41771,
        ],
      },
      {
        name: '战斗 - 武略',
        items: [
          5669,
          5670,
          5671,
          5672,
          5673,
          18019,
          25188,
          26729,
          33919,
          33932,
          41759,
          41772,
        ],
      },
      {
        name: '战斗 - 战技',
        items: [
          5714,
          5715,
          5716,
          5717,
          5718,
          18028,
          25197,
          26738,
          33928,
          33941,
          41768,
          41781,
        ],
      },
      {
        name: '战斗 - 咏唱',
        items: [
          5719,
          5720,
          5721,
          5722,
          5723,
          18029,
          25198,
          26739,
          33929,
          33942,
          41769,
          41782,
        ],
      },
      {
        name: '战斗 - 刚柔',
        items: [
          5679,
          5680,
          5681,
          5682,
          5683,
          18021,
          25190,
          26731,
          33921,
          33934,
          41761,
          41774,
        ],
      },
      {
        name: '战斗 - 信力',
        items: [
          5629,
          5630,
          5631,
          5632,
          5633,
          18011,
          25186,
          26727,
          33917,
          33930,
          41757,
          41770,
        ],
      },
      {
        name: '制作 - 魔匠',
        items: [
          5704,
          5705,
          5706,
          5707,
          5708,
          18026,
          25195,
          26736,
          33926,
          33939,
          41766,
          41779,
        ],
      },
      {
        name: '制作 - 巨匠',
        items: [
          5709,
          5710,
          5711,
          5712,
          5713,
          18027,
          25196,
          26737,
          33927,
          33940,
          41767,
          41780,
        ],
      },
      {
        name: '制作 - 名匠',
        items: [
          5699,
          5700,
          5701,
          5702,
          5703,
          18025,
          25194,
          26735,
          33925,
          33938,
          41765,
          41778,
        ],
      },
      {
        name: '采集 - 器识',
        items: [
          5694,
          5695,
          5696,
          5697,
          5698,
          18024,
          25193,
          26734,
          33924,
          33937,
          41764,
          41777,
        ],
      },
      {
        name: '采集 - 达识',
        items: [
          5684,
          5685,
          5686,
          5687,
          5688,
          18022,
          25191,
          26732,
          33922,
          33935,
          41762,
          41775,
        ],
      },
      {
        name: '采集 - 博识',
        items: [
          5689,
          5690,
          5691,
          5692,
          5693,
          18023,
          25192,
          26733,
          33923,
          33936,
          41763,
          41776,
        ],
      },
    ],
  },
] as const
