export const fallbackItems: Record<number, {
  ID: number
  Name: string
  Icon: string
}> = {
  45690: {
    ID: 45690,
    Name: '宇宙信用点',
    Icon: '/i/065000/065112.png',
  },
  45984: {
    ID: 45984,
    Name: '渗透型防腐涂料',
    Icon: '/i/020000/020661.png',
  },
  45985: {
    ID: 45985,
    Name: '夏劳尼焦炭',
    Icon: '/i/021000/021462.png',
  },
  45986: {
    ID: 45986,
    Name: '新生王国研磨剂',
    Icon: '/i/021000/021479.png',
  },
  45987: {
    ID: 45987,
    Name: '克罗诺兽的粗皮',
    Icon: '/i/021000/021820.png',
  },
  45988: {
    ID: 45988,
    Name: '不飞鸟的毛',
    Icon: '/i/021000/021616.png',
  },
  45989: {
    ID: 45989,
    Name: '多色炼金药',
    Icon: '/i/022000/022670.png',
  },
  47929: {
    ID: 47929,
    Name: '星际航员短衣',
    Icon: '/i/057000/057224.png',
  },
  47930: {
    ID: 47930,
    Name: '星际航员手套',
    Icon: '/i/056000/056339.png',
  },
  47931: {
    ID: 47931,
    Name: '星际航员长裤',
    Icon: '/i/057000/057749.png',
  },
  47932: {
    ID: 47932,
    Name: '星际航员长靴',
    Icon: '/i/057000/057841.png',
  },
  47985: {
    ID: 47985,
    Name: '演技教材·气得发抖',
    Icon: '/i/026000/026435.png',
  },
  48153: {
    ID: 48153,
    Name: '面部配饰：阅读眼镜',
    Icon: '/i/026000/026074.png',
  },
  48163: {
    ID: 48163,
    Name: '霓虹粉染剂',
    Icon: '/i/022000/022805.png',
  },
  48164: {
    ID: 48164,
    Name: '明亮橙染剂',
    Icon: '/i/022000/022809.png',
  },
  48165: {
    ID: 48165,
    Name: '霓虹绿染剂',
    Icon: '/i/022000/022810.png',
  },
  48166: {
    ID: 48166,
    Name: '霓虹黄染剂',
    Icon: '/i/022000/022806.png',
  },
  48167: {
    ID: 48167,
    Name: '罗兰紫染剂',
    Icon: '/i/022000/022812.png',
  },
  48168: {
    ID: 48168,
    Name: '碧空蓝染剂',
    Icon: '/i/022000/022804.png',
  },
  48211: {
    ID: 48211,
    Name: '管弦乐琴乐谱：西德老大',
    Icon: '/i/025000/025945.png',
  },
  48213: {
    ID: 48213,
    Name: '管弦乐琴乐谱：飞空艇',
    Icon: '/i/025000/025945.png',
  },
  48227: {
    ID: 48227,
    Name: '胭脂红染剂',
    Icon: '/i/022000/022805.png',
  },
  48732: {
    ID: 48732,
    Name: '宇宙座椅',
    Icon: '/i/052000/052836.png',
  },
  48735: {
    ID: 48735,
    Name: '宇宙路灯',
    Icon: '/i/053000/053715.png',
  },
}
