const cosmosExploration = {
  45690: {
    ID: 45690,
    Name: '宇宙信用点',
    Icon: '/i/065000/065112.png',
  },
  45984: {
    ID: 45984,
    Name: '渗透型防腐涂料',
    Icon: '/i/020000/020661.png',
  },
  45985: {
    ID: 45985,
    Name: '夏劳尼焦炭',
    Icon: '/i/021000/021462.png',
  },
  45986: {
    ID: 45986,
    Name: '新生王国研磨剂',
    Icon: '/i/021000/021479.png',
  },
  45987: {
    ID: 45987,
    Name: '克罗诺兽的粗皮',
    Icon: '/i/021000/021820.png',
  },
  45988: {
    ID: 45988,
    Name: '不飞鸟的毛',
    Icon: '/i/021000/021616.png',
  },
  45989: {
    ID: 45989,
    Name: '多色炼金药',
    Icon: '/i/022000/022670.png',
  },
  47929: {
    ID: 47929,
    Name: '星际航员短衣',
    Icon: '/i/057000/057224.png',
  },
  47930: {
    ID: 47930,
    Name: '星际航员手套',
    Icon: '/i/056000/056339.png',
  },
  47931: {
    ID: 47931,
    Name: '星际航员长裤',
    Icon: '/i/057000/057749.png',
  },
  47932: {
    ID: 47932,
    Name: '星际航员长靴',
    Icon: '/i/057000/057841.png',
  },
  47985: {
    ID: 47985,
    Name: '演技教材·气得发抖',
    Icon: '/i/026000/026435.png',
  },
  48153: {
    ID: 48153,
    Name: '面部配饰：阅读眼镜',
    Icon: '/i/026000/026074.png',
  },
  48163: {
    ID: 48163,
    Name: '霓虹粉染剂',
    Icon: '/i/022000/022805.png',
  },
  48164: {
    ID: 48164,
    Name: '明亮橙染剂',
    Icon: '/i/022000/022809.png',
  },
  48165: {
    ID: 48165,
    Name: '霓虹绿染剂',
    Icon: '/i/022000/022810.png',
  },
  48166: {
    ID: 48166,
    Name: '霓虹黄染剂',
    Icon: '/i/022000/022806.png',
  },
  48167: {
    ID: 48167,
    Name: '罗兰紫染剂',
    Icon: '/i/022000/022812.png',
  },
  48168: {
    ID: 48168,
    Name: '碧空蓝染剂',
    Icon: '/i/022000/022804.png',
  },
  48211: {
    ID: 48211,
    Name: '管弦乐琴乐谱：西德老大',
    Icon: '/i/025000/025945.png',
  },
  48213: {
    ID: 48213,
    Name: '管弦乐琴乐谱：飞空艇',
    Icon: '/i/025000/025945.png',
  },
  48227: {
    ID: 48227,
    Name: '胭脂红染剂',
    Icon: '/i/022000/022805.png',
  },
  48732: {
    ID: 48732,
    Name: '宇宙座椅',
    Icon: '/i/052000/052836.png',
  },
  48735: {
    ID: 48735,
    Name: '宇宙路灯',
    Icon: '/i/053000/053715.png',
  },
}

const crescentIsle = {
  45043: {
    ID: 45043,
    Name: '十二城邦银币',
    Icon: '/i/065000/065119.png',
  },
  45044: {
    ID: 45044,
    Name: '十二城邦金币',
    Icon: '/i/065000/065118.png',
  },
  47740: {
    ID: 47740,
    Name: '辅助道具：古旧的钱箱',
    Icon: '/i/026000/026527.png',
  },
  47741: {
    ID: 47741,
    Name: '魔恢复药',
    Icon: '/i/020000/020603.png',
  },
  47891: {
    ID: 47891,
    Name: '里克斯头链',
    Icon: '/i/056000/056822.png',
  },
  47892: {
    ID: 47892,
    Name: '里克斯长衣',
    Icon: '/i/057000/057214.png',
  },
  47893: {
    ID: 47893,
    Name: '里克斯半指护手',
    Icon: '/i/056000/056329.png',
  },
  47894: {
    ID: 47894,
    Name: '里克斯骑兵裤',
    Icon: '/i/057000/057739.png',
  },
  47895: {
    ID: 47895,
    Name: '里克斯长靴',
    Icon: '/i/057000/057831.png',
  },
  47972: {
    ID: 47972,
    Name: '斯卡拉乌洛萨帕',
    Icon: '/i/059000/059941.png',
  },
  48139: {
    ID: 48139,
    Name: '新月奖杯',
    Icon: '/i/053000/053513.png',
  },
  48144: {
    ID: 48144,
    Name: '新月岛全景图',
    Icon: '/i/051000/051583.png',
  },
  48157: {
    ID: 48157,
    Name: '魔法棱晶（礼花彩带）',
    Icon: '/i/021000/021294.png',
  },
  48206: {
    ID: 48206,
    Name: '管弦乐琴乐谱：城镇主题曲　～金曦～',
    Icon: '/i/025000/025945.png',
  },
  48207: {
    ID: 48207,
    Name: '管弦乐琴乐谱：新世界　～金曦～',
    Icon: '/i/025000/025945.png',
  },
  47896: {
    ID: 47896,
    Name: '泰空公主发夹',
    Icon: '/i/056000/056824.png',
  },
  47897: {
    ID: 47897,
    Name: '泰空公主连体衣',
    Icon: '/i/057000/057216.png',
  },
  47898: {
    ID: 47898,
    Name: '泰空公主礼服手套',
    Icon: '/i/056000/056331.png',
  },
  47899: {
    ID: 47899,
    Name: '泰空公主紧身裤',
    Icon: '/i/057000/057741.png',
  },
  47900: {
    ID: 47900,
    Name: '泰空公主高跟鞋',
    Icon: '/i/057000/057833.png',
  },
  47901: {
    ID: 47901,
    Name: '谢维兹发夹',
    Icon: '/i/056000/056823.png',
  },
  47902: {
    ID: 47902,
    Name: '谢维兹大衣',
    Icon: '/i/057000/057215.png',
  },
  47903: {
    ID: 47903,
    Name: '谢维兹臂甲',
    Icon: '/i/056000/056330.png',
  },
  47904: {
    ID: 47904,
    Name: '谢维兹短裙',
    Icon: '/i/057000/057740.png',
  },
  47905: {
    ID: 47905,
    Name: '谢维兹矮靴',
    Icon: '/i/057000/057832.png',
  },
  48143: {
    ID: 48143,
    Name: '知见水晶（复制品）',
    Icon: '/i/052000/052835.png',
  },
  48204: {
    ID: 48204,
    Name: '管弦乐琴乐谱：文明的景观盒',
    Icon: '/i/025000/025945.png',
  },
  48205: {
    ID: 48205,
    Name: '管弦乐琴乐谱：战祸的景观盒',
    Icon: '/i/025000/025945.png',
  },
}

export const fallbackItems: Record<number, {
  ID: number
  Name: string
  Icon: string
}> = {
  ...cosmosExploration,
  ...crescentIsle,
}
